/* 
  ITDevicePhotosViewCtrl.strings
  iToolsMain

  Created by Aaron on 7/17/13.
  Copyright (c) 2013 __MyCompanyName__. All rights reserved.
*/

"RemoveCameraRollAlertTitle"        = "Due to the limitation of iOS, Can't remove Camera Roll Album!";
"RemoveDeviceAlbumAlertTitle"       = "Due to the limitation of iOS, Can't remove album created on the device!";
"RemovePhotoLibraryAlertTitle"      = "Due to the limitation of iOS, Can't remove Photo Library Album!";
"RemoveCameraRollPhotoAlertTitle"   = "Due to the limitation of iOS, Can't remove photo(s) in Camera Roll Album!";
"ImportCameraRollPhotoAlertTitle"   = "Due to the limitation of iOS, Can't import photo(s) in Camera Roll Album!";
"RemoveDeviceAlbumPhotoAlertTitle"  = "Due to the limitation of iOS, Can't remove photo(s) in album created on the device!";
"ImportDeviceAlbumPhotoAlertTitle"  = "Due to the limitation of iOS, Can't import photo(s) in album created on the device!";

"RemoveAlbumAlertTitle"     = "Are you sure you want to remove the album(s)?";
"RemovePhotoAlertTitle"     = "Are you sure you want to remove the photo(s)?";
"RemoveAlertDefaultButton"  = "OK";
"RemoveAlertAlternateButton"= "Cancel";

"StatusTotalPhotoTemplate"      = "%d Photos";
"StatusTotalVideoTemplate"      = "%d Videos";
"StatusSelectedPhotoTemplate"   = "%d Selected";
"StatusSelectedVideoTemplate"   = "%d Selected";

"ContextMenuImport"         = "Import";
"ContextMenuRemove"         = "Remove";
"ContextMenuExport"         = "Export";
"ContextMenuBack"           = "Back";

"ProgressImport"            = "Importing...";
"ProgressRefresh"           = "Refresh...";
"ProgressRemove"            = "Removing...";
"ProgressCopy"              = "Copying files...";

"UnsupportedFileAlbumAlertTitle"    = "Unsupported file types\nPhotos only supports png, jpg file, and folders that containing these files";
"UnsupportedFileAlertTitle"         = "Unsupported file types\nAlbum only supports png, jpg file";
"UnsupportedFileDeviceAlertTitle"   = "Due to the limitation of iOS, Can't import photo(s) in Camera Roll Album and albums created on the device";

"IOS83PhotoImportAlertTitle"        = "Due to the limitation of iOS, Can't import photo(s)!";
"IOS83PhotoRemoveAlertTitle"        = "Due to the limitation of iOS, Can't remove photo(s)!";
